cookbook.org
:PROPERTIES:
#+STARTUP: overview inlineimages
#+TAGS: @baking @breakfast @entree @side @soup @stew @sauce @dressing
#+TAGS: GF(g)
#+OPTIONS: toc:nil
#+HUGO_BASE_DIR: /home/trevdev/Projects/os-cookbook/
#+HUGO_SECTION: recipe
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_FRONT_MATTER_FORMAT: yaml
:END:
#+TITLE: Open Source Cookbook
#+AUTHOR: "Trev"
** Falafel
:PROPERTIES:
:export_file_name: falafel
:export_hugo_custom_front_matter: :servings 6
:export_hugo_custom_front_matter+: :prep-time 15
:export_hugo_custom_front_matter+: :cook-time 40
:export_hugo_custom_front_matter+: :ready-in 55
:export_hugo_custom_front_matter+: :source-url https://toriavey.com/toris-kitchen/falafel/
:END:
*** Ingredients

- 1 lb dry chickpeas (also known as garbanzo beans). You must start with dry, do NOT substitute canned, they will not work!
- 1/2 tsp baking soda
- 1 small onion, roughly chopped
- 1/4 cup chopped fresh parsley
- 3-5 cloves garlic (I prefer roasted garlic cloves)
- 1 1/2 tbsp flour or chickpea flour
- 1 3/4 tsp salt
- 2 tsp cumin
- 1 tsp ground coriander
- 1/4 tsp black pepper
- 1/4 tsp cayenne pepper
- Pinch of ground cardamom
- 1 tsp baking powder (optional - makes the falafel more fluffy)
- Vegetable oil for frying - grapeseed, sunflower, avocado, canola, and peanut oils all work well

*** Directions

1. One day ahead:  Pour the chickpeas into a large bowl and cover them by about 3 inches of cold water. Add 1/2 tsp of baking soda to the water and stir; this will help soften the chickpeas. Cover the bowl and let them soak overnight in a cool, dark place or in the refrigerator. The chickpeas should soak at least 12 hours and up to 24 hours, until tender (change soaking water for fresh water after 12 hours). They will double in size as they soak – you will have between 4 and 5 cups of beans after soaking.
2. Drain and rinse the chickpeas well. Pour them into your food processor along with the chopped onion, garlic cloves, parsley, flour or chickpea flour (use chickpea flour to make gluten free), salt, cumin, ground coriander, black pepper, cayenne pepper, and cardamom.  Note : if you have a smaller food processor, you will want to divide the ingredients in half and process the mixture one batch at a time.
3. Pulse all ingredients together until a rough, coarse meal forms. Scrape the sides of the processor periodically and push the mixture down the sides. Process until the mixture is somewhere between the texture of couscous and a paste. You want the mixture to hold together, and a more paste-like consistency will help with that... but don't over-process, you don't want it turning into hummus!
4. Once the mixture reaches the desired consistency, pour it out into a bowl and use a fork to stir; this will make the texture more even throughout. Remove any large chickpea chunks that the processor missed.  Cover the bowl with plastic wrap and refrigerate for 1-2 hours.  Fill a skillet with vegetable oil to a depth of 1 ½ inches. I prefer to use cooking oil with a high smoke point, like grapeseed. Heat the oil slowly over medium heat. The ideal temperature to fry falafel is between 360 and 375 degrees F; the best way to monitor the temperature is to use a deep fry or candy thermometer. After making these a few times, you will start to get a feel for when the oil temperature is "right."  Meanwhile, form falafel mixture into round balls or slider-shaped patties using wet hands or a falafel scoop. I usually use about 2 tbsp of mixture per falafel. You can make them smaller or larger depending on your personal preference. The balls will stick together loosely at first, but will bind nicely once they begin to fry.
5. If the balls won't hold together, place the mixture back in the processor again and continue processing to make it more paste-like. Keep in mind that the balls will be delicate at first; if you can get them into the hot oil, they will bind together and stick. If they still won't hold together, you can try adding 2-3 tbsp of flour or chickpea flour to the mixture. If they still won't hold, add 1-2 eggs to the mix. This should fix any issues you are having.  Before frying my first batch of falafel, I like to fry a test one in the center of the pan. If the oil is at the right temperature, it will take 2-3 minutes per side to brown (5-6 minutes total). If it browns faster than that, your oil is too hot and your falafels will not be fully cooked in the center. Cool the oil down slightly and try again.
6. When the oil is at the right temperature, fry the falafels in batches of 5-6 at a time until golden brown on both sides.
7. Once the falafels are fried, remove them from the oil using a slotted spoon.
8. Let them drain on paper towels. Serve the falafels fresh and hot; they go best with a plate of hummus and topped with creamy tahini sauce. You can also stuff them into a pita.
9. SESAME FALAFEL VARIATION : After forming the balls or patties, dip them in sesame seeds prior to frying. This will make the falafel coating crunchier and give it a slightly nutty flavor.
10. HERB FALAFEL VARIATION (GREEN FALAFEL) : Add ½ cup additional chopped green parsley, or cilantro, or a mixture of the two prior to blending.
11. TURMERIC FALAFEL (YELLOW FALAFEL) : Add ¾ tsp turmeric to the food processor prior to blending.
12. HOW TO MAKE A FALAFEL PITA : Making a falafel pita is actually really simple. The two main ingredients are pita bread and falafel.   Cut the pita bread in half to form two “pockets.” Each pocket is a serving size. Stuff the pocket with falafel, as well as any add-ons you fancy.  Here are some traditional add-ons that can be added to your pita: tahini sauce, shredded lettuce, diced or sliced tomatoes, Israeli salad, onions, dill pickles, hummus, tabouli, french fries
13. Here are some less traditional add-ons that are also tasty: sprouts, cucumber slices, roasted peppers, roasted eggplant slices, sunflower seeds, feta cheese, yogurt, tzatziki.

